
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 5 to add, 69 to change, 5 to destroy.</code></pre>

* Update
  * azurerm_automation_account.pre-aa
  * azurerm_bastion_host.bastion
  * azurerm_data_protection_backup_vault.pre_backup_vault
  * azurerm_dev_test_global_vm_shutdown_schedule.powerbi_dg_vm[0]
  * azurerm_dev_test_global_vm_shutdown_schedule.powerbi_dg_vm[1]
  * azurerm_disk_encryption_set.pre-des
  * azurerm_key_vault_access_policy.dts_pre_access
  * azurerm_managed_disk.dtgtwaydatadisk[0]
  * azurerm_managed_disk.dtgtwaydatadisk[1]
  * azurerm_managed_disk.vmdatadisk[0]
  * azurerm_media_services_account.ams
  * azurerm_network_interface.dtgwnic[0]
  * azurerm_network_interface.dtgwnic[1]
  * azurerm_network_interface.nic[0]
  * azurerm_network_security_group.dg_nsg
  * azurerm_private_endpoint.ams_streamingendpoint_private_endpoint
  * azurerm_public_ip.pip
  * azurerm_resource_group.rg
  * azurerm_resource_group.rg_backup
  * azurerm_route_table.postgres
  * azurerm_virtual_machine_extension.daa-agent[0]
  * azurerm_virtual_machine_extension.dtgtwayvmextension[0]
  * azurerm_virtual_machine_extension.dtgtwayvmextension[1]
  * azurerm_virtual_machine_extension.dtgtwydaa-agent[0]
  * azurerm_virtual_machine_extension.dtgtwydaa-agent[1]
  * azurerm_virtual_machine_extension.dtgtwymonitor-agent[0]
  * azurerm_virtual_machine_extension.dtgtwymonitor-agent[1]
  * azurerm_virtual_machine_extension.monitor-agent[0]
  * azurerm_virtual_machine_extension.msmonitor-agent[0]
  * azurerm_virtual_machine_extension.vm_aad[0]
  * azurerm_virtual_machine_extension.vmextension[0]
  * azurerm_virtual_network.vnet
  * azurerm_windows_virtual_machine.dtgtwyvm[0]
  * azurerm_windows_virtual_machine.dtgtwyvm[1]
  * azurerm_windows_virtual_machine.vm[0]
  * module.data_gateway_vm[0].azurerm_managed_disk.managed_disks[&#34;datadisk1&#34;]
  * module.data_gateway_vm[0].azurerm_network_interface.vm_nic
  * module.data_gateway_vm[0].azurerm_virtual_machine_extension.vmextension[0]
  * module.data_gateway_vm[0].azurerm_windows_virtual_machine.winvm[0]
  * module.data_gateway_vm[1].azurerm_managed_disk.managed_disks[&#34;datadisk1&#34;]
  * module.data_gateway_vm[1].azurerm_network_interface.vm_nic
  * module.data_gateway_vm[1].azurerm_virtual_machine_extension.vmextension[0]
  * module.data_gateway_vm[1].azurerm_windows_virtual_machine.winvm[0]
  * module.data_store_db_v14.azurerm_postgresql_flexible_server.pgsql_server
  * module.dynatrace-oneagent[0].azurerm_virtual_machine_extension.dynatrace-oneagent[0]
  * module.dynatrace-oneagent-dtgtway[0].azurerm_virtual_machine_extension.dynatrace-oneagent[0]
  * module.dynatrace-oneagent-dtgtway[1].azurerm_virtual_machine_extension.dynatrace-oneagent[0]
  * module.edit_vm[0].azurerm_managed_disk.managed_disks[&#34;datadisk1&#34;]
  * module.edit_vm[0].azurerm_network_interface.vm_nic
  * module.finalsa_storage_account.azurerm_private_endpoint.this[0]
  * module.finalsa_storage_account.azurerm_storage_account.storage_account
  * module.finalsa_storage_account_backup.azurerm_storage_account.storage_account
  * module.ingestsa_storage_account.azurerm_private_endpoint.this[0]
  * module.ingestsa_storage_account.azurerm_storage_account.storage_account
  * module.ingestsa_storage_account_backup.azurerm_storage_account.storage_account
  * module.key-vault.azurerm_key_vault.kv
  * module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds
  * module.key-vault.azurerm_user_assigned_identity.managed_identity[0]
  * module.powerBI_data_gateway[0].azurerm_managed_disk.managed_disks[&#34;datadisk1&#34;]
  * module.powerBI_data_gateway[0].azurerm_network_interface.vm_nic
  * module.powerBI_data_gateway[0].azurerm_virtual_machine_extension.vmextension[0]
  * module.powerBI_data_gateway[0].azurerm_windows_virtual_machine.winvm[0]
  * module.powerBI_data_gateway[1].azurerm_managed_disk.managed_disks[&#34;datadisk1&#34;]
  * module.powerBI_data_gateway[1].azurerm_network_interface.vm_nic
  * module.powerBI_data_gateway[1].azurerm_virtual_machine_extension.vmextension[0]
  * module.powerBI_data_gateway[1].azurerm_windows_virtual_machine.winvm[0]
  * module.sa_storage_account.azurerm_private_endpoint.this[0]
  * module.sa_storage_account.azurerm_storage_account.storage_account
  * module.sa_storage_account_backup.azurerm_storage_account.storage_account
* Replace
  * azurerm_virtual_machine_extension.aad[0]
  * azurerm_virtual_machine_extension.edit_init[0]
  * module.edit_vm[0].azurerm_virtual_machine_data_disk_attachment.data_disk_attachments[&#34;datadisk1&#34;]
  * module.edit_vm[0].azurerm_virtual_machine_extension.vmextension[0]
  * module.edit_vm[0].azurerm_windows_virtual_machine.winvm[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_automation_account.pre-aa will be updated in-place
  ~ resource "azurerm_automation_account" "pre-aa" {
        id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Automation/automationAccounts/pre-stg-aa"
        name                          = "pre-stg-aa"
      ~ tags                          = {
          - "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git" -> null
          + "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          - "changeUrl"           = "" -> null
            # (5 unchanged elements hidden)
        }
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_bastion_host.bastion will be updated in-place
  ~ resource "azurerm_bastion_host" "bastion" {
        id                     = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Network/bastionHosts/pre-bastion-stg"
        name                   = "pre-bastion-stg"
      ~ tags                   = {
          - "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git" -> null
          + "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          - "changeUrl"           = "" -> null
            # (5 unchanged elements hidden)
        }
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_data_protection_backup_vault.pre_backup_vault will be updated in-place
  ~ resource "azurerm_data_protection_backup_vault" "pre_backup_vault" {
        id                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.DataProtection/backupVaults/pre-backup-vault-stg"
        name                = "pre-backup-vault-stg"
      ~ tags                = {
          - "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git" -> null
          + "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          - "changeUrl"           = "" -> null
            # (5 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_dev_test_global_vm_shutdown_schedule.powerbi_dg_vm[0] will be updated in-place
  ~ resource "azurerm_dev_test_global_vm_shutdown_schedule" "powerbi_dg_vm" {
        id                    = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.DevTestLab/schedules/shutdown-computevm-powerbi-1-stg"
      ~ tags                  = {
          - "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git" -> null
          + "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          - "changeUrl"           = "" -> null
            # (5 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_dev_test_global_vm_shutdown_schedule.powerbi_dg_vm[1] will be updated in-place
  ~ resource "azurerm_dev_test_global_vm_shutdown_schedule" "powerbi_dg_vm" {
        id                    = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.DevTestLab/schedules/shutdown-computevm-powerbi-2-stg"
      ~ tags                  = {
          - "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git" -> null
          + "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          - "changeUrl"           = "" -> null
            # (5 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_disk_encryption_set.pre-des will be updated in-place
  ~ resource "azurerm_disk_encryption_set" "pre-des" {
        id                        = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Compute/diskEncryptionSets/pre-des"
        name                      = "pre-des"
      ~ tags                      = {
          - "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git" -> null
          + "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          - "changeUrl"           = "" -> null
            # (5 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_key_vault_access_policy.dts_pre_access will be updated in-place
  ~ resource "azurerm_key_vault_access_policy" "dts_pre_access" {
      ~ certificate_permissions = [
            "List",
          - "Update",
          - "Create",
          - "Import",
          - "Delete",
          - "ManageContacts",
          - "ManageIssuers",
          + "Get",
            "GetIssuers",
            "ListIssuers",
          - "SetIssuers",
          - "DeleteIssuers",
          - "Recover",
        ]
        id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg/objectId/b1fd4154-355f-4683-a795-d09cdb814d16"
      ~ key_permissions         = [
            "List",
          - "Update",
          - "Create",
          - "Import",
          - "Delete",
          - "Recover",
          + "Get",
        ]
      ~ secret_permissions      = [
            "List",
          - "Set",
          - "Delete",
          - "Recover",
          + "Get",
        ]
      ~ storage_permissions     = [
          + "List",
          + "Get",
        ]
        # (3 unchanged attributes hidden)
    }

  # azurerm_managed_disk.dtgtwaydatadisk[0] will be updated in-place
  ~ resource "azurerm_managed_disk" "dtgtwaydatadisk" {
        id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Compute/disks/predtgtwy0-datadisk-stg"
        name                          = "predtgtwy0-datadisk-stg"
      ~ tags                          = {
          - "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git" -> null
          + "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          - "changeUrl"           = "" -> null
            # (5 unchanged elements hidden)
        }
        # (16 unchanged attributes hidden)
    }

  # azurerm_managed_disk.dtgtwaydatadisk[1] will be updated in-place
  ~ resource "azurerm_managed_disk" "dtgtwaydatadisk" {
        id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Compute/disks/predtgtwy1-datadisk-stg"
        name                          = "predtgtwy1-datadisk-stg"
      ~ tags                          = {
          - "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git" -> null
          + "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          - "changeUrl"           = "" -> null
            # (5 unchanged elements hidden)
        }
        # (16 unchanged attributes hidden)
    }

  # azurerm_managed_disk.vmdatadisk[0] will be updated in-place
  ~ resource "azurerm_managed_disk" "vmdatadisk" {
        id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Compute/disks/pre-videditvm0-datadisk-stg"
        name                          = "pre-videditvm0-datadisk-stg"
      ~ tags                          = {
          - "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git" -> null
          + "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          - "changeUrl"           = "" -> null
            # (5 unchanged elements hidden)
        }
        # (16 unchanged attributes hidden)
    }

  # azurerm_media_services_account.ams will be updated in-place
  ~ resource "azurerm_media_services_account" "ams" {
        id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Media/mediaServices/preamsstg"
        name                          = "preamsstg"
      ~ tags                          = {
          - "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git" -> null
          + "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          - "changeUrl"           = "" -> null
            # (5 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)

      - storage_account {
          - id         = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/prefinalsastg" -> null
          - is_primary = false -> null

          - managed_identity {
              - use_system_assigned_identity = false -> null
              - user_assigned_identity_id    = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourcegroups/managed-identities-stg-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/pre-stg-mi" -> null
            }
        }
      + storage_account {
          + id         = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/prefinalsastg"
          + is_primary = false
        }
      - storage_account {
          - id         = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/preingestsastg" -> null
          - is_primary = true -> null

          - managed_identity {
              - use_system_assigned_identity = false -> null
              - user_assigned_identity_id    = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourcegroups/managed-identities-stg-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/pre-stg-mi" -> null
            }
        }
      + storage_account {
          + id         = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/preingestsastg"
          + is_primary = true
        }

        # (3 unchanged blocks hidden)
    }

  # azurerm_network_interface.dtgwnic[0] will be updated in-place
  ~ resource "azurerm_network_interface" "dtgwnic" {
        id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Network/networkInterfaces/pre-dtgwnic0-stg"
        name                          = "pre-dtgwnic0-stg"
      ~ tags                          = {
          - "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git" -> null
          + "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          - "changeUrl"           = "" -> null
            # (5 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_network_interface.dtgwnic[1] will be updated in-place
  ~ resource "azurerm_network_interface" "dtgwnic" {
        id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Network/networkInterfaces/pre-dtgwnic1-stg"
        name                          = "pre-dtgwnic1-stg"
      ~ tags                          = {
          - "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git" -> null
          + "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          - "changeUrl"           = "" -> null
            # (5 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_network_interface.nic[0] will be updated in-place
  ~ resource "azurerm_network_interface" "nic" {
        id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Network/networkInterfaces/pre-videditnic0-stg"
        name                          = "pre-videditnic0-stg"
      ~ tags                          = {
          - "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git" -> null
          + "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          - "changeUrl"           = "" -> null
            # (5 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_network_security_group.dg_nsg will be updated in-place
  ~ resource "azurerm_network_security_group" "dg_nsg" {
        id                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Network/networkSecurityGroups/dg-nsg-stg"
        name                = "dg-nsg-stg"
      ~ tags                = {
          - "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git" -> null
          + "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          - "changeUrl"           = "" -> null
            # (5 unchanged elements hidden)
        }
        # (3 unchanged attributes hidden)
    }

  # azurerm_private_endpoint.ams_streamingendpoint_private_endpoint will be updated in-place
  ~ resource "azurerm_private_endpoint" "ams_streamingendpoint_private_endpoint" {
        id                       = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Network/privateEndpoints/ams-streamingendpoint-pe-stg"
        name                     = "ams-streamingendpoint-pe-stg"
      ~ tags                     = {
          - "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git" -> null
          + "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          - "changeUrl"           = "" -> null
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # azurerm_public_ip.pip will be updated in-place
  ~ resource "azurerm_public_ip" "pip" {
        id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Network/publicIPAddresses/pre-bastionpip-stg"
        name                    = "pre-bastionpip-stg"
      ~ tags                    = {
          - "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git" -> null
          + "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          - "changeUrl"           = "" -> null
            # (5 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)
    }

  # azurerm_resource_group.rg will be updated in-place
  ~ resource "azurerm_resource_group" "rg" {
        id       = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg"
        name     = "pre-stg"
      ~ tags     = {
          - "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git" -> null
          + "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          - "changeUrl"           = "" -> null
            # (5 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)
    }

  # azurerm_resource_group.rg_backup will be updated in-place
  ~ resource "azurerm_resource_group" "rg_backup" {
        id       = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg-backup"
        name     = "pre-stg-backup"
      ~ tags     = {
          - "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git" -> null
          + "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          - "changeUrl"           = "" -> null
            # (5 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)
    }

  # azurerm_route_table.postgres will be updated in-place
  ~ resource "azurerm_route_table" "postgres" {
        id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Network/routeTables/pre-stg-route-table"
        name                          = "pre-stg-route-table"
      ~ tags                          = {
          - "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git" -> null
          + "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          - "changeUrl"           = "" -> null
            # (5 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # azurerm_virtual_machine_extension.aad[0] must be replaced
-/+ resource "azurerm_virtual_machine_extension" "aad" {
      - automatic_upgrade_enabled   = false -> null
      ~ id                          = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Compute/virtualMachines/edit-vm1-stg/extensions/AADLoginForWindows" -> (known after apply)
        name                        = "AADLoginForWindows"
      ~ tags                        = {
          - "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git" -> null
          + "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          - "changeUrl"           = "" -> null
            # (5 unchanged elements hidden)
        }
      ~ virtual_machine_id          = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Compute/virtualMachines/edit-vm1-stg" -> (known after apply) # forces replacement
        # (5 unchanged attributes hidden)
    }

  # azurerm_virtual_machine_extension.daa-agent[0] will be updated in-place
  ~ resource "azurerm_virtual_machine_extension" "daa-agent" {
        id                          = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Compute/virtualMachines/pre-videditvm0-stg/extensions/DependencyAgentWindows"
        name                        = "DependencyAgentWindows"
      ~ tags                        = {
          - "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git" -> null
          + "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          - "changeUrl"           = "" -> null
            # (5 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # azurerm_virtual_machine_extension.dtgtwayvmextension[0] will be updated in-place
  ~ resource "azurerm_virtual_machine_extension" "dtgtwayvmextension" {
        id                          = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Compute/virtualMachines/predtgtwy0-stg/extensions/IaaSAntimalware"
        name                        = "IaaSAntimalware"
      ~ tags                        = {
          - "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git" -> null
          + "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          - "changeUrl"           = "" -> null
            # (5 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # azurerm_virtual_machine_extension.dtgtwayvmextension[1] will be updated in-place
  ~ resource "azurerm_virtual_machine_extension" "dtgtwayvmextension" {
        id                          = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Compute/virtualMachines/predtgtwy1-stg/extensions/IaaSAntimalware"
        name                        = "Ia

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

es/edit-vm1-stg/dataDisks/edit-vm01-data-stg" -> (known after apply)
      ~ virtual_machine_id        = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Compute/virtualMachines/edit-vm1-stg" -> (known after apply) # forces replacement
        # (5 unchanged attributes hidden)
    }

  # module.edit_vm[0].azurerm_virtual_machine_extension.vmextension[0] must be replaced
-/+ resource "azurerm_virtual_machine_extension" "vmextension" {
      - automatic_upgrade_enabled   = false -> null
      ~ id                          = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Compute/virtualMachines/edit-vm1-stg/extensions/azure-disk-encrypt-80WS" -> (known after apply)
        name                        = "azure-disk-encrypt-80WS"
      ~ tags                        = {
          - "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git" -> null
          + "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          - "changeUrl"           = "" -> null
            # (5 unchanged elements hidden)
        }
      ~ virtual_machine_id          = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Compute/virtualMachines/edit-vm1-stg" -> (known after apply) # forces replacement
        # (6 unchanged attributes hidden)
    }

  # module.edit_vm[0].azurerm_windows_virtual_machine.winvm[0] must be replaced
-/+ resource "azurerm_windows_virtual_machine" "winvm" {
      - availability_set_id           = "" -> null
      - capacity_reservation_group_id = "" -> null
      ~ custom_data                   = (sensitive value) # forces replacement
      - dedicated_host_group_id       = "" -> null
      - dedicated_host_id             = "" -> null
      - edge_zone                     = "" -> null
      - encryption_at_host_enabled    = false -> null
      - eviction_policy               = "" -> null
      ~ id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Compute/virtualMachines/edit-vm1-stg" -> (known after apply)
      - license_type                  = "" -> null
        name                          = "edit-vm1-stg"
      ~ private_ip_address            = "10.101.0.6" -> (known after apply)
      ~ private_ip_addresses          = [
          - "10.101.0.6",
        ] -> (known after apply)
      - proximity_placement_group_id  = "" -> null
      ~ public_ip_address             = "" -> (known after apply)
      ~ public_ip_addresses           = [] -> (known after apply)
      - secure_boot_enabled           = false -> null
      - source_image_id               = "" -> null
      ~ tags                          = {
          - "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git" -> null
          + "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          - "changeUrl"           = "" -> null
            # (5 unchanged elements hidden)
        }
      - timezone                      = "" -> null
      - user_data                     = "" -> null
      ~ virtual_machine_id            = "33e396cc-a187-4403-8f88-5c9a32a9d029" -> (known after apply)
      - virtual_machine_scale_set_id  = "" -> null
      - vtpm_enabled                  = false -> null
        # (18 unchanged attributes hidden)

      ~ os_disk {
          ~ disk_size_gb              = 127 -> (known after apply)
          ~ name                      = "edit-vm1-stg_OsDisk_1_4f5c6f73fbd4483d8537af733ec7460a" -> (known after apply)
            # (3 unchanged attributes hidden)
        }

      + termination_notification {
          + enabled = (known after apply)
          + timeout = (known after apply)
        }

        # (1 unchanged block hidden)
    }

  # module.finalsa_storage_account.azurerm_private_endpoint.this[0] will be updated in-place
  ~ resource "azurerm_private_endpoint" "this" {
        id                       = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Network/privateEndpoints/prefinalsastg"
        name                     = "prefinalsastg"
      ~ tags                     = {
          - "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git" -> null
          + "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          - "changeUrl"           = "" -> null
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.finalsa_storage_account.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/prefinalsastg"
        name                              = "prefinalsastg"
      ~ tags                              = {
          - "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git" -> null
          + "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          - "changeUrl"           = "" -> null
            # (5 unchanged elements hidden)
        }
        # (38 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.finalsa_storage_account_backup.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg-backup/providers/Microsoft.Storage/storageAccounts/prefinalsabackupstg"
        name                              = "prefinalsabackupstg"
      ~ tags                              = {
          - "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git" -> null
          + "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          - "changeUrl"           = "" -> null
            # (5 unchanged elements hidden)
        }
        # (37 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.ingestsa_storage_account.azurerm_private_endpoint.this[0] will be updated in-place
  ~ resource "azurerm_private_endpoint" "this" {
        id                       = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Network/privateEndpoints/preingestsastg"
        name                     = "preingestsastg"
      ~ tags                     = {
          - "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git" -> null
          + "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          - "changeUrl"           = "" -> null
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ingestsa_storage_account.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/preingestsastg"
        name                              = "preingestsastg"
      ~ tags                              = {
          - "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git" -> null
          + "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          - "changeUrl"           = "" -> null
            # (5 unchanged elements hidden)
        }
        # (38 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ingestsa_storage_account_backup.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg-backup/providers/Microsoft.Storage/storageAccounts/preingestsabackupstg"
        name                              = "preingestsabackupstg"
      ~ tags                              = {
          - "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git" -> null
          + "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          - "changeUrl"           = "" -> null
            # (5 unchanged elements hidden)
        }
        # (37 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.key-vault.azurerm_key_vault.kv will be updated in-place
  ~ resource "azurerm_key_vault" "kv" {
        id                              = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg"
        name                            = "pre-stg"
      ~ tags                            = {
          - "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git" -> null
          + "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          - "changeUrl"           = "" -> null
            # (5 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg|pre-stg"
        name                       = "pre-stg"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.key-vault.azurerm_user_assigned_identity.managed_identity[0] will be updated in-place
  ~ resource "azurerm_user_assigned_identity" "managed_identity" {
        id                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/managed-identities-stg-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/pre-stg-mi"
        name                = "pre-stg-mi"
      ~ tags                = {
          - "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git" -> null
          + "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          - "changeUrl"           = "" -> null
            # (5 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.powerBI_data_gateway[0].azurerm_managed_disk.managed_disks["datadisk1"] will be updated in-place
  ~ resource "azurerm_managed_disk" "managed_disks" {
        id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Compute/disks/powerbi-dg1-data-stg"
        name                          = "powerbi-dg1-data-stg"
      ~ tags                          = {
          - "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git" -> null
          + "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          - "changeUrl"           = "" -> null
            # (5 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)
    }

  # module.powerBI_data_gateway[0].azurerm_network_interface.vm_nic will be updated in-place
  ~ resource "azurerm_network_interface" "vm_nic" {
        id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Network/networkInterfaces/powerbi-dg1-nic-stg"
        name                          = "powerbi-dg1-nic-stg"
      ~ tags                          = {
          - "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git" -> null
          + "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          - "changeUrl"           = "" -> null
            # (5 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.powerBI_data_gateway[0].azurerm_virtual_machine_extension.vmextension[0] will be updated in-place
  ~ resource "azurerm_virtual_machine_extension" "vmextension" {
        id                          = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Compute/virtualMachines/powerbi-1-stg/extensions/azure-disk-encrypt-9HCQ"
        name                        = "azure-disk-encrypt-9HCQ"
      ~ tags                        = {
          - "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git" -> null
          + "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          - "changeUrl"           = "" -> null
            # (5 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.powerBI_data_gateway[0].azurerm_windows_virtual_machine.winvm[0] will be updated in-place
  ~ resource "azurerm_windows_virtual_machine" "winvm" {
        id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Compute/virtualMachines/powerbi-1-stg"
        name                          = "powerbi-1-stg"
      ~ tags                          = {
          - "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git" -> null
          + "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          - "changeUrl"           = "" -> null
            # (5 unchanged elements hidden)
        }
        # (38 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.powerBI_data_gateway[1].azurerm_managed_disk.managed_disks["datadisk1"] will be updated in-place
  ~ resource "azurerm_managed_disk" "managed_disks" {
        id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Compute/disks/powerbi-dg2-data-stg"
        name                          = "powerbi-dg2-data-stg"
      ~ tags                          = {
          - "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git" -> null
          + "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          - "changeUrl"           = "" -> null
            # (5 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)
    }

  # module.powerBI_data_gateway[1].azurerm_network_interface.vm_nic will be updated in-place
  ~ resource "azurerm_network_interface" "vm_nic" {
        id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Network/networkInterfaces/powerbi-dg2-nic-stg"
        name                          = "powerbi-dg2-nic-stg"
      ~ tags                          = {
          - "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git" -> null
          + "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          - "changeUrl"           = "" -> null
            # (5 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.powerBI_data_gateway[1].azurerm_virtual_machine_extension.vmextension[0] will be updated in-place
  ~ resource "azurerm_virtual_machine_extension" "vmextension" {
        id                          = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Compute/virtualMachines/powerbi-2-stg/extensions/azure-disk-encrypt-gMLX"
        name                        = "azure-disk-encrypt-gMLX"
      ~ tags                        = {
          - "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git" -> null
          + "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          - "changeUrl"           = "" -> null
            # (5 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.powerBI_data_gateway[1].azurerm_windows_virtual_machine.winvm[0] will be updated in-place
  ~ resource "azurerm_windows_virtual_machine" "winvm" {
        id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Compute/virtualMachines/powerbi-2-stg"
        name                          = "powerbi-2-stg"
      ~ tags                          = {
          - "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git" -> null
          + "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          - "changeUrl"           = "" -> null
            # (5 unchanged elements hidden)
        }
        # (38 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.sa_storage_account.azurerm_private_endpoint.this[0] will be updated in-place
  ~ resource "azurerm_private_endpoint" "this" {
        id                       = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Network/privateEndpoints/presastg"
        name                     = "presastg"
      ~ tags                     = {
          - "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git" -> null
          + "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          - "changeUrl"           = "" -> null
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.sa_storage_account.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/presastg"
        name                              = "presastg"
      ~ tags                              = {
          - "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git" -> null
          + "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          - "changeUrl"           = "" -> null
            # (5 unchanged elements hidden)
        }
        # (38 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sa_storage_account_backup.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg-backup/providers/Microsoft.Storage/storageAccounts/presabackupstg"
        name                              = "presabackupstg"
      ~ tags                              = {
          - "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git" -> null
          + "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          - "changeUrl"           = "" -> null
            # (5 unchanged elements hidden)
        }
        # (37 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

Plan: 5 to add, 69 to change, 5 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":572,"Program":"tfcmt","SHA1":"","Vars":{}} -->